/*********************************************************************************************************
* 模块名称: PolynomialFit.h
* 摘    要: 多项式拟合
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2019 SZLY. All rights reserved.)
* 完成日期: 2019年08月01日
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/
#ifndef _POLYNOMIAL_FIT_H_
#define _POLYNOMIAL_FIT_H_
/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
double CalcPolynomial(double* a, double x, unsigned char older);                              //计算多项式
double Polynomia_y_to_x(double* a, float x1, float x2,unsigned char older,double y,float gap,float pre);        //求解多项式单调区间中的值
double CalcPolyIntegral(double* a, double x1, double x2, unsigned char older);                //多项式积分
double FindMaxInPolynomial(double* a, double x1, double x2, unsigned char older, double gap); //查找最大值
double FindFirstMaxInPolynomial(double* a, double x1, double x2, unsigned char older, double gap);
void PolynomialFit(double* x, double* y, double* output, int maxn, unsigned char older);      //多项式拟合
//void GaussianFit(double* x, double* y,int maxn,double* x_max,double* y_max,double* s);        //高斯拟合
#endif

